build.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:add xmlns:ns2="http://www.openiam.org/service/connector" xmlns:ns3="http://www.openiam.org/service/types" xmlns:ns4="urn:idm.openiam.org/srvc/continfo/dto" xmlns:ns5="urn:idm.openiam.org/srvc/role/dto" xmlns:ns6="urn:idm.openiam.org/srvc/grp/dto" xmlns:ns7="urn:idm.openiam.org/srvc/user/dto" xmlns:ns8="urn:idm.openiam.org/srvc/org/dto"><reqType><requestID>R8d910e24f4514829af0faa724113098d</requestID><targetID>297ec33c3ced62d2013ced72f8e20002</targetID><hostUrl>23.21.229.176</hostUrl><hostLoginId>administrator</hostLoginId><hostLoginPassword>=tdWk2eqV8P</hostLoginPassword><baseDN>OU=555,OU=test,DC=ad,DC=openiamdemo,DC=info</baseDN><userIdentity></userIdentity><operation>ADD</operation><user><ns3:operation>0</ns3:operation><ns3:attributes><ns3:name>Surname</ns3:name><ns3:value>VllUMjNfMUw=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>GivenName</ns3:name><ns3:value>VllUMjNfMUY=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>DisplayName</ns3:name><ns3:value>VllUMjNfMUwsVllUMjNfMUY=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>homeDirectory</ns3:name><ns3:value>XFxkZXZzZXJ2ZXJcU1lTVk9MXGlkbWRldi5sb2NhbA==</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>Path</ns3:name><ns3:value>b3U9NTU1LG91PXRlc3QsZGM9YWQsZGM9b3BlbmlhbWRlbW8sZGM9aW5mbw==</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>ProfilePath</ns3:name><ns3:value>Yzo=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>HomeDrive</ns3:name><ns3:value>SDo=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>ScriptPath</ns3:name><ns3:value>bmV0eHAuY21k</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>Company</ns3:name><ns3:value>T3BlbklBTQ==</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>Name</ns3:name><ns3:value></ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>AccountPassword</ns3:name><ns3:value>UGFzc3dvcmQkNTE=</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>Office</ns3:name><ns3:value>TUFJTk9GRklDRQ==</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>SamAccountName</ns3:name><ns3:value></ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:attributes><ns3:name>Enabled</ns3:name><ns3:value>VHJ1ZQ==</ns3:value><ns3:operation>1</ns3:operation><ns3:multivalued>false</ns3:multivalued><ns3:dataType>string</ns3:dataType></ns3:attributes><ns3:principalFieldName>sAMAccountName</ns3:principalFieldName><ns3:principalFieldDataType>string</ns3:principalFieldDataType></user><scriptHandler>ADPowershell.ps1</scriptHandler></reqType></ns2:add></soap:Body></soap:Envelope>